Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 48, 48, 3)    0                                            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 46, 46, 32)   896         input_3[0][0]                    
__________________________________________________________________________________________________
p_re_lu_8 (PReLU)               (None, 46, 46, 32)   32          conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 23, 23, 32)   0           p_re_lu_8[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 21, 21, 64)   18496       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
p_re_lu_9 (PReLU)               (None, 21, 21, 64)   64          conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 10, 10, 64)   0           p_re_lu_9[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
p_re_lu_10 (PReLU)              (None, 8, 8, 64)     64          conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 4, 4, 64)     0           p_re_lu_10[0][0]                 
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 3, 3, 128)    32896       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
p_re_lu_11 (PReLU)              (None, 3, 3, 128)    128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 1152)         0           p_re_lu_11[0][0]                 
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 256)          295168      flatten_2[0][0]                  
__________________________________________________________________________________________________
p_re_lu_12 (PReLU)              (None, 256)          256         dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 2)            514         p_re_lu_12[0][0]                 
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 4)            1028        p_re_lu_12[0][0]                 
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 10)           2570        p_re_lu_12[0][0]                 
__________________________________________________________________________________________________
softmax_3 (Softmax)             (None, 2)            0           dense_5[0][0]                    
==================================================================================================
Total params: 389,040
Trainable params: 389,040
Non-trainable params: 0
__________________________________________________________________________________________________
