Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, None, 3 0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, None, None, 1 280         input_1[0][0]                    
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, None, None, 1 10          conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, None, None, 1 0           p_re_lu_1[0][0]                  
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, None, None, 1 1456        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, None, None, 1 16          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, None, None, 3 4640        p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
p_re_lu_3 (PReLU)               (None, None, None, 3 32          conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, None, None, 2 66          p_re_lu_3[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, None, None, 4 132         p_re_lu_3[0][0]                  
__________________________________________________________________________________________________
softmax_1 (Softmax)             (None, None, None, 2 0           conv2d_4[0][0]                   
==================================================================================================
Total params: 6,632
Trainable params: 6,632
Non-trainable params: 0
__________________________________________________________________________________________________
