Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 24, 24, 3)    0                                            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 22, 22, 28)   784         input_2[0][0]                    
__________________________________________________________________________________________________
p_re_lu_4 (PReLU)               (None, 22, 22, 28)   28          conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 11, 11, 28)   0           p_re_lu_4[0][0]                  
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 9, 9, 48)     12144       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
p_re_lu_5 (PReLU)               (None, 9, 9, 48)     48          conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 4, 4, 48)     0           p_re_lu_5[0][0]                  
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 3, 3, 64)     12352       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
p_re_lu_6 (PReLU)               (None, 3, 3, 64)     64          conv2d_8[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 576)          0           p_re_lu_6[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          73856       flatten_1[0][0]                  
__________________________________________________________________________________________________
p_re_lu_7 (PReLU)               (None, 128)          128         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2)            258         p_re_lu_7[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 4)            516         p_re_lu_7[0][0]                  
__________________________________________________________________________________________________
softmax_2 (Softmax)             (None, 2)            0           dense_2[0][0]                    
==================================================================================================
Total params: 100,178
Trainable params: 100,178
Non-trainable params: 0
__________________________________________________________________________________________________
